{
  "resourceName": "Immunization",
  "attr_labels": {
    "note": "Extra information about the immunization that is not conveyed by the other attributes.",
    "primarySource": "An indication that the content of the record is based on information from the person who administered the vaccine. This reflects the context under which the data was originally recorded.",
    "education": "Educational material presented to the patient (or guardian) at the time of vaccine administration.",
    "doseQuantity": "The quantity of vaccine product that was administered.",
    "reaction.date": "Date of reaction to the immunization.",
    "protocolApplied.authority": "Indicates the authority who published the protocol (e.g. ACIP) that is being followed.",
    "reasonReference": "Condition, Observation or DiagnosticReport that supports why the immunization was administered.",
    "protocolApplied.series": "One possible path to achieve presumed immunity against a disease - within the context of an authority.",
    "manufacturer": "Name of vaccine manufacturer.",
    "programEligibility": "Indicates a patient\u0027s eligibility for a funding program.",
    "performer.function": "Describes the type of performance (e.g. ordering provider, administering provider, etc.).",
    "statusReason": "Indicates the reason the immunization event was not performed.",
    "isSubpotent": "Indication if a dose is considered to be subpotent. By default, a dose should be considered to be potent.",
    "protocolApplied.targetDisease": "The vaccine preventable disease the dose is being administered against.",
    "patient": "The patient who either received or did not receive the immunization.",
    "performer.actor": "The practitioner or organization who performed the action.",
    "education.presentationDate": "Date the educational material was given to the patient.",
    "reasonCode": "Reasons why the vaccine was administered.",
    "reaction.reported": "Self-reported indicator.",
    "vaccineCode": "Vaccine that was administered or was to be administered.",
    "expirationDate": "Date vaccine batch expires.",
    "education.publicationDate": "Date the educational material was published.",
    "identifier": "A unique identifier assigned to this immunization record.",
    "performer": "Indicates who performed the immunization event.",
    "reaction": "Categorical data indicating that an adverse event is associated in time to an immunization.",
    "education.documentType": "Identifier of the material presented to the patient.",
    "subpotentReason": "Reason why a dose is considered to be subpotent.",
    "encounter": "The visit or admission or other contact between patient and health care provider the immunization was performed as part of.",
    "lotNumber": "Lot number of the  vaccine product.",
    "recorded": "The date the occurrence of the immunization was first captured in the record - potentially significantly after the occurrence of the event.",
    "reaction.detail": "Details of the reaction.",
    "site": "Body site where vaccine was administered.",
    "route": "The path by which the vaccine product is taken into the body.",
    "protocolApplied": "The protocol (set of recommendations) being followed by the provider who administered the dose.",
    "reportOrigin": "The source of the data when the report of the immunization event is not based on information from the person who administered the vaccine.",
    "location": "The service delivery location where the vaccine administration occurred.",
    "education.reference": "Reference pointer to the educational material given to the patient if the information was on line.",
    "fundingSource": "Indicates the source of the vaccine actually administered. This may be different than the patient eligibility (e.g. the patient may be eligible for a publically purchased vaccine but due to inventory issues, vaccine purchased with private funds was actually administered).",
    "status": "Indicates the current status of the immunization event."
  }
}