{
  "resourceName": "Patient",
  "attr_labels": {
    "communication.language": "The ISO-639-1 alpha 2 code in lower case for the language, optionally followed by a hyphen and the ISO-3166-1 alpha 2 code for the region in upper case; e.g. \\en\\ for English, or \\en-US\\ for American English versus \\en-EN\\ for England English.",
    "gender": "Administrative Gender - the gender that the patient is considered to have for administration and record keeping purposes.",
    "link.other": "The other patient resource that the link refers to.",
    "contact.address": "Address for the contact person.",
    "link": "Link to another patient resource that concerns the same actual patient.",
    "contact.gender": "Administrative Gender - the gender that the contact person is considered to have for administration and record keeping purposes.",
    "contact.organization": "Organization on behalf of which the contact is acting or for which the contact is working.",
    "link.type": "The type of link between this patient resource and another patient resource.",
    "contact": "A contact party (e.g. guardian, partner, friend) for the patient.",
    "generalPractitioner": "Patient\u0027s nominated care provider.",
    "telecom": "A contact detail (e.g. a telephone number or an email address) by which the individual may be contacted.",
    "communication": "A language which may be used to communicate with the patient about his or her health.",
    "identifier": "An identifier for this patient.",
    "address": "An address for the individual.",
    "active": "Whether this patient record is in active use. \nMany systems use this property to mark as non-current patients, such as those that have not been seen for a period of time based on an organization\u0027s business rules.\n\nIt is often used to filter patient lists to exclude inactive patients\n\nDeceased patients may also be marked as inactive for the same reasons, but may be active for some time after death.",
    "photo": "Image of the patient.",
    "contact.relationship": "The nature of the relationship between the patient and the contact person.",
    "birthDate": "The date of birth for the individual.",
    "contact.telecom": "A contact detail for the person, e.g. a telephone number or an email address.",
    "contact.name": "A name associated with the contact person.",
    "contact.period": "The period during which this contact person or organization is valid to be contacted relating to this patient.",
    "managingOrganization": "Organization that is the custodian of the patient record.",
    "name": "A name associated with the individual.",
    "communication.preferred": "Indicates whether or not the patient prefers this language (over other languages he masters up a certain level).",
    "maritalStatus": "This field contains a patient\u0027s most recent marital (civil) status."
  }
}