{
  "resourceName": "Contract_Action",
  "attr_information": {
    "Contract_Action.reasonCode": "Rationale for the action to be performed or not performed. Describes why the action is permitted or prohibited.",
    "Contract_Action.occurrenceDateTime": "When action happens.",
    "Contract_Action._doNotPerform": "Extensions for doNotPerform",
    "Contract_Action.subject": "Entity of the action.",
    "Contract_Action._performerLinkId": "Extensions for performerLinkId",
    "Contract_Action.doNotPerform": "True if the term prohibits the  action.",
    "Contract_Action.linkId": "Id [identifier??] of the clause or question text related to this action in the referenced form or QuestionnaireResponse.",
    "Contract_Action.context": "Encounter or Episode with primary association to specified term activity.",
    "Contract_Action.id": "Unique id for the element within a resource (for internal references). This may be any string value that does not contain spaces.",
    "Contract_Action.extension": "May be used to represent additional information that is not part of the basic definition of the element. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
    "Contract_Action.performerType": "The type of individual that is desired or required to perform or not perform the action.",
    "Contract_Action.intent": "Reason or purpose for the action stipulated by this Contract Provision.",
    "Contract_Action.note": "Comments made about the term action made by the requester, performer, subject or other participants.",
    "Contract_Action.performerRole": "The type of role or competency of an individual desired or required to perform or not perform the action.",
    "Contract_Action.performer": "Indicates who or what is being asked to perform (or not perform) the ction.",
    "Contract_Action.reason": "Describes why the action is to be performed or not performed in textual form.",
    "Contract_Action.modifierExtension": "May be used to represent additional information that is not part of the basic definition of the element and that modifies the understanding of the element in which it is contained and/or the understanding of the containing element\u0027s descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).",
    "Contract_Action.occurrencePeriod": "When action happens.",
    "Contract_Action._securityLabelNumber": "Extensions for securityLabelNumber",
    "Contract_Action.status": "Current state of the term action.",
    "Contract_Action._requesterLinkId": "Extensions for requesterLinkId",
    "Contract_Action._contextLinkId": "Extensions for contextLinkId",
    "Contract_Action.type": "Activity or service obligation to be done or not done, performed or not performed, effectuated or not by this Contract term.",
    "Contract_Action._reason": "Extensions for reason",
    "Contract_Action.reasonLinkId": "Id [identifier??] of the clause or question text related to the reason type or reference of this  action in the referenced form or QuestionnaireResponse.",
    "Contract_Action.occurrenceTiming": "When action happens.",
    "Contract_Action._reasonLinkId": "Extensions for reasonLinkId",
    "Contract_Action.contextLinkId": "Id [identifier??] of the clause or question text related to the requester of this action in the referenced form or QuestionnaireResponse.",
    "Contract_Action.securityLabelNumber": "Security labels that protects the action.",
    "Contract_Action._occurrenceDateTime": "Extensions for occurrenceDateTime",
    "Contract_Action.requester": "Who or what initiated the action and has responsibility for its activation.",
    "Contract_Action.performerLinkId": "Id [identifier??] of the clause or question text related to the reason type or reference of this  action in the referenced form or QuestionnaireResponse.",
    "Contract_Action.reasonReference": "Indicates another resource whose existence justifies permitting or not permitting this action.",
    "Contract_Action._linkId": "Extensions for linkId",
    "Contract_Action.requesterLinkId": "Id [identifier??] of the clause or question text related to the requester of this action in the referenced form or QuestionnaireResponse."
  }
}