{
  "resourceName": "Immunization",
  "attr_information": {
    "Immunization.reasonCode": "Reasons why the vaccine was administered.",
    "Immunization.fundingSource": "Indicates the source of the vaccine actually administered. This may be different than the patient eligibility (e.g. the patient may be eligible for a publically purchased vaccine but due to inventory issues, vaccine purchased with private funds was actually administered).",
    "Immunization._occurrenceDateTime": "Extensions for occurrenceDateTime",
    "Immunization.doseQuantity": "The quantity of vaccine product that was administered.",
    "Immunization.reaction": "Categorical data indicating that an adverse event is associated in time to an immunization.",
    "Immunization.isSubpotent": "Indication if a dose is considered to be subpotent. By default, a dose should be considered to be potent.",
    "Immunization._recorded": "Extensions for recorded",
    "Immunization._implicitRules": "Extensions for implicitRules",
    "Immunization.reportOrigin": "The source of the data when the report of the immunization event is not based on information from the person who administered the vaccine.",
    "Immunization.note": "Extra information about the immunization that is not conveyed by the other attributes.",
    "Immunization.text": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.",
    "Immunization.occurrenceDateTime": "Date vaccine administered or was to be administered.",
    "Immunization.implicitRules": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.",
    "Immunization._language": "Extensions for language",
    "Immunization.primarySource": "An indication that the content of the record is based on information from the person who administered the vaccine. This reflects the context under which the data was originally recorded.",
    "Immunization._isSubpotent": "Extensions for isSubpotent",
    "Immunization.language": "The base language in which the resource is written.",
    "Immunization.subpotentReason": "Reason why a dose is considered to be subpotent.",
    "Immunization.reasonReference": "Condition, Observation or DiagnosticReport that supports why the immunization was administered.",
    "Immunization.occurrenceString": "Date vaccine administered or was to be administered.",
    "Immunization.meta": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.",
    "Immunization._lotNumber": "Extensions for lotNumber",
    "Immunization.site": "Body site where vaccine was administered.",
    "Immunization._primarySource": "Extensions for primarySource",
    "Immunization.resourceType": "This is a Immunization resource",
    "Immunization._occurrenceString": "Extensions for occurrenceString",
    "Immunization.statusReason": "Indicates the reason the immunization event was not performed.",
    "Immunization.education": "Educational material presented to the patient (or guardian) at the time of vaccine administration.",
    "Immunization.contained": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.",
    "Immunization.identifier": "A unique identifier assigned to this immunization record.",
    "Immunization.protocolApplied": "The protocol (set of recommendations) being followed by the provider who administered the dose.",
    "Immunization.extension": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
    "Immunization.route": "The path by which the vaccine product is taken into the body.",
    "Immunization._status": "Extensions for status",
    "Immunization.patient": "The patient who either received or did not receive the immunization.",
    "Immunization.status": "Indicates the current status of the immunization event.",
    "Immunization.expirationDate": "Date vaccine batch expires.",
    "Immunization.lotNumber": "Lot number of the  vaccine product.",
    "Immunization.performer": "Indicates who performed the immunization event.",
    "Immunization.vaccineCode": "Vaccine that was administered or was to be administered.",
    "Immunization.encounter": "The visit or admission or other contact between patient and health care provider the immunization was performed as part of.",
    "Immunization.location": "The service delivery location where the vaccine administration occurred.",
    "Immunization.manufacturer": "Name of vaccine manufacturer.",
    "Immunization._expirationDate": "Extensions for expirationDate",
    "Immunization.programEligibility": "Indicates a patient\u0027s eligibility for a funding program.",
    "Immunization.modifierExtension": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element\u0027s descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).",
    "Immunization.recorded": "The date the occurrence of the immunization was first captured in the record - potentially significantly after the occurrence of the event.",
    "Immunization.id": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes."
  }
}