{
  "resourceName": "ImmunizationRecommendation_Recommendation",
  "attr_information": {
    "ImmunizationRecommendation_Recommendation._seriesDosesString": "Extensions for seriesDosesString",
    "ImmunizationRecommendation_Recommendation.seriesDosesPositiveInt": "The recommended number of doses to achieve immunity.",
    "ImmunizationRecommendation_Recommendation.targetDisease": "The targeted disease for the recommendation.",
    "ImmunizationRecommendation_Recommendation.modifierExtension": "May be used to represent additional information that is not part of the basic definition of the element and that modifies the understanding of the element in which it is contained and/or the understanding of the containing element\u0027s descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).",
    "ImmunizationRecommendation_Recommendation.forecastReason": "The reason for the assigned forecast status.",
    "ImmunizationRecommendation_Recommendation.vaccineCode": "Vaccine(s) or vaccine group that pertain to the recommendation.",
    "ImmunizationRecommendation_Recommendation._series": "Extensions for series",
    "ImmunizationRecommendation_Recommendation.supportingImmunization": "Immunization event history and/or evaluation that supports the status and recommendation.",
    "ImmunizationRecommendation_Recommendation._description": "Extensions for description",
    "ImmunizationRecommendation_Recommendation.doseNumberPositiveInt": "Nominal position of the recommended dose in a series (e.g. dose 2 is the next recommended dose).",
    "ImmunizationRecommendation_Recommendation.supportingPatientInformation": "Patient Information that supports the status and recommendation.  This includes patient observations, adverse reactions and allergy/intolerance information.",
    "ImmunizationRecommendation_Recommendation.extension": "May be used to represent additional information that is not part of the basic definition of the element. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
    "ImmunizationRecommendation_Recommendation.seriesDosesString": "The recommended number of doses to achieve immunity.",
    "ImmunizationRecommendation_Recommendation.doseNumberString": "Nominal position of the recommended dose in a series (e.g. dose 2 is the next recommended dose).",
    "ImmunizationRecommendation_Recommendation.id": "Unique id for the element within a resource (for internal references). This may be any string value that does not contain spaces.",
    "ImmunizationRecommendation_Recommendation.contraindicatedVaccineCode": "Vaccine(s) which should not be used to fulfill the recommendation.",
    "ImmunizationRecommendation_Recommendation.dateCriterion": "Vaccine date recommendations.  For example, earliest date to administer, latest date to administer, etc.",
    "ImmunizationRecommendation_Recommendation._doseNumberString": "Extensions for doseNumberString",
    "ImmunizationRecommendation_Recommendation.series": "One possible path to achieve presumed immunity against a disease - within the context of an authority.",
    "ImmunizationRecommendation_Recommendation._seriesDosesPositiveInt": "Extensions for seriesDosesPositiveInt",
    "ImmunizationRecommendation_Recommendation.forecastStatus": "Indicates the patient status with respect to the path to immunity for the target disease.",
    "ImmunizationRecommendation_Recommendation._doseNumberPositiveInt": "Extensions for doseNumberPositiveInt"
  }
}