{
  "resourceName": "PractitionerRole_AvailableTime",
  "attr_information": {
    "PractitionerRole_AvailableTime.extension": "May be used to represent additional information that is not part of the basic definition of the element. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.",
    "PractitionerRole_AvailableTime._availableStartTime": "Extensions for availableStartTime",
    "PractitionerRole_AvailableTime.availableStartTime": "The opening time of day. Note: If the AllDay flag is set, then this time is ignored.",
    "PractitionerRole_AvailableTime.daysOfWeek": "Indicates which days of the week are available between the start and end Times.",
    "PractitionerRole_AvailableTime.id": "Unique id for the element within a resource (for internal references). This may be any string value that does not contain spaces.",
    "PractitionerRole_AvailableTime._availableEndTime": "Extensions for availableEndTime",
    "PractitionerRole_AvailableTime._daysOfWeek": "Extensions for daysOfWeek",
    "PractitionerRole_AvailableTime._allDay": "Extensions for allDay",
    "PractitionerRole_AvailableTime.modifierExtension": "May be used to represent additional information that is not part of the basic definition of the element and that modifies the understanding of the element in which it is contained and/or the understanding of the containing element\u0027s descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).",
    "PractitionerRole_AvailableTime.allDay": "Is this always available? (hence times are irrelevant) e.g. 24 hour service.",
    "PractitionerRole_AvailableTime.availableEndTime": "The closing time of day. Note: If the AllDay flag is set, then this time is ignored."
  }
}